results/bun/aponiajs.txt
Bundle: 406.0 KB
Startup: 114.3 ms
Memory before: 65.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     49432.10    7750.41   64945.69
  Latency       10.11ms     1.81ms    57.92ms
  HTTP codes:
    1xx - 0, 2xx - 493825, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.76MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     55499.38    3314.78   60918.39
  Latency        9.01ms   488.06us    31.19ms
  HTTP codes:
    1xx - 0, 2xx - 554326, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    10.88MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     44911.91    3813.93   49781.80
  Latency       11.14ms     0.90ms    47.75ms
  HTTP codes:
    1xx - 0, 2xx - 448319, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.09MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       499.71      79.16     749.26
  Latency       20.01ms     5.94ms    77.26ms
  HTTP codes:
    1xx - 0, 2xx - 4995, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.58GB/s

Memory after: 72.2 MB