results/bun/bun-web-standard.txt
Bundle: 1.7 KB
Startup: 54.3 ms
Memory before: 42.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     77399.20    6538.37   84879.59
  Latency        6.47ms   676.22us    51.74ms
  HTTP codes:
    1xx - 0, 2xx - 771986, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.17MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     61374.41    3145.84   67062.71
  Latency        8.15ms   530.27us    39.20ms
  HTTP codes:
    1xx - 0, 2xx - 612640, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.84MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     71063.19    3615.05   77027.08
  Latency        7.04ms   503.45us    39.23ms
  HTTP codes:
    1xx - 0, 2xx - 709445, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.13MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       511.20      79.76     883.74
  Latency       19.57ms     6.10ms    73.66ms
  HTTP codes:
    1xx - 0, 2xx - 5110, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.73GB/s

Memory after: 53.6 MB