results/bun/bun.txt
Bundle: 2.3 KB
Startup: 54.3 ms
Memory before: 42.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     82307.37    5143.52   90624.30
  Latency        6.08ms   738.29us    53.69ms
  HTTP codes:
    1xx - 0, 2xx - 820008, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.99MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     71773.61    4767.10   83707.67
  Latency        6.97ms   531.79us    31.10ms
  HTTP codes:
    1xx - 0, 2xx - 716947, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    15.03MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     64769.19    9202.18   72580.93
  Latency        7.72ms     1.39ms    64.14ms
  HTTP codes:
    1xx - 0, 2xx - 646755, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    16.58MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       516.34      79.94     791.59
  Latency       19.35ms     5.84ms    71.61ms
  HTTP codes:
    1xx - 0, 2xx - 5168, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.80GB/s

Memory after: 51.8 MB