results/bun/effect.txt
Bundle: 264.4 KB
Startup: 108.2 ms
Memory before: 63.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     27372.57    4889.35   34853.91
  Latency       18.30ms     3.61ms    99.26ms
  HTTP codes:
    1xx - 0, 2xx - 273038, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.29MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     23471.82    1825.95   26255.14
  Latency       21.30ms     1.14ms    47.54ms
  HTTP codes:
    1xx - 0, 2xx - 234642, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.60MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     17510.98    2349.10   23218.78
  Latency       28.54ms     1.70ms    56.02ms
  HTTP codes:
    1xx - 0, 2xx - 175120, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.48MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       471.58      79.77     710.64
  Latency       21.23ms     5.20ms    88.70ms
  HTTP codes:
    1xx - 0, 2xx - 4710, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.20GB/s

Memory after: 147.9 MB