results/bun/elysia.txt
Bundle: 160.8 KB
Startup: 51.8 ms
Memory before: 51.4 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    120056.50    6307.68  135303.78
  Latency        4.16ms   364.22us    32.22ms
  HTTP codes:
    1xx - 0, 2xx - 1198216, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.42MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     77399.03    7326.03   86592.89
  Latency        6.46ms     0.86ms    46.03ms
  HTTP codes:
    1xx - 0, 2xx - 771976, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    16.19MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     72061.75    6273.15   78730.48
  Latency        6.94ms   742.26us    30.45ms
  HTTP codes:
    1xx - 0, 2xx - 720088, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.42MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       535.51      80.30     801.29
  Latency       18.67ms     5.90ms    71.92ms
  HTTP codes:
    1xx - 0, 2xx - 5350, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.04GB/s

Memory after: 54.7 MB