results/bun/express.txt
Bundle: 821.9 KB
Startup: 107.1 ms
Memory before: 78.4 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     19032.98    2880.02   22809.68
  Latency       26.26ms     4.24ms   114.87ms
  HTTP codes:
    1xx - 0, 2xx - 190355, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.42MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     18107.05    1492.86   21126.64
  Latency       27.58ms     1.23ms    58.53ms
  HTTP codes:
    1xx - 0, 2xx - 181244, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.52MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     12589.96    1655.54   15361.85
  Latency       39.68ms     3.69ms   107.39ms
  HTTP codes:
    1xx - 0, 2xx - 126058, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.18MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       121.57     179.26     515.38
  Latency       82.06ms    10.05ms   168.65ms
  HTTP codes:
    1xx - 0, 2xx - 1225, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.61GB/s

Memory after: 207.6 MB